/* eslint-disable max-lines */
export default class Enums {
  // eslint-disable-next-line
  static NAMES = ["莘庄","外环路","莲花路","锦江乐园","上海南站","漕宝路","上海体育馆","徐家汇","衡山路","常熟路","陕西南路","黄陂南路","人民广场","新闸路","汉中路","上海火车站","中山北路","延长路","上海马戏城","汶水路","彭浦新村","共康路","通河新村","呼兰路","共富新村","宝安公路","友谊西路","富锦路","广兰路","金科路","张江高科","龙阳路","世纪公园","上海科技馆","世纪大道","东昌路","陆家嘴","南京东路","南京西路","静安寺","江苏路","中山公园","娄山关路","威宁路","北新泾","淞虹路","虹桥2号航站楼","虹桥火车站","徐泾东","浦东国际机场","海天三路","远东大道","凌空路","川沙","华夏东路","创新中路","唐镇","江杨北路","铁力路","友谊路","宝杨路","水产路","淞滨路","张华浜","淞发路","长江南路","殷高西路","江湾镇","大柏树","赤峰路","虹口足球场","东宝兴路","宝山路","中潭路","镇坪路","曹杨路","金沙江路","延安西路","虹桥路","宜山路","漕溪路","龙漕路","石龙路","海伦路","临平路","大连路","杨树浦路","浦东大道","浦电路(4号线)","蓝村路","塘桥","南浦大桥","西藏南路","鲁班路","大木桥路","东安路","上海体育场","闵行开发区","文井路","华宁路","金平路","东川路","剑川路","北桥","颛桥","银都路","春申路","东方体育中心","灵岩南路","上南路","华夏西路","高青路","东明路","高科西路","临沂新村","上海儿童医学中心","浦电路(6号线)","源深体育中心","民生路","北洋泾路","德平路","云山路","金桥路","博兴路","五莲路","巨峰路","东靖路","五洲大道","洲海路","外高桥保税区南","航津路","外高桥保税区北","港城路","花木路","芳华路","锦绣路","杨高南路","云台路","耀华路","长清路","后滩","龙华中路","肇嘉浜路","昌平路","长寿路","岚皋路","新村路","大华三路","行知路","大场镇","场中路","上大路","南陈路","上海大学","祁华路","顾村公园","刘行","潘广路","罗南新村","美兰湖","沈杜公路","联航路","江月路","浦江镇","芦恒路","凌兆新村","杨思","成山路","中华艺术宫","陆家浜路","老西门","大世界","曲阜路","中兴路","西藏北路","曲阳路","四平路","鞍山新村","江浦路","黄兴路","延吉中路","黄兴公园","翔殷路","嫩江路","市光路","曹路","民雷路","顾唐路","金海路","金吉路","金桥","台儿庄路","蓝天路","芳甸路","杨高中路","商城路","小南门","马当路","打浦桥","嘉善路","桂林路","漕河泾开发区","合川路","星中路","七宝","中春路","九亭","泗泾","佘山","洞泾","松江大学城","松江新城","松江体育中心","醉白池","松江南站","新江湾城","殷高东路","三门路","江湾体育场","五角场","国权路","同济大学","邮电新村","四川北路","天潼路","豫园","新天地","上海图书馆","交通大学","宋园路","伊犁路","水城路","龙溪路","龙柏新村","紫藤路","航中路","上海动物园","虹桥1号航站楼","嘉定北","嘉定西","白银路","嘉定新城","马陆","南翔","桃浦新村","武威路","祁连山路","李子园","上海西站","真如","枫桥路","隆德路","上海游泳馆","龙华","云锦路","龙耀路","三林","三林东","浦三路","御桥","罗山路","秀沿路","康新公路","迪士尼","上海赛车场","昌吉东路","上海汽车城","安亭","兆丰路","光明路","花桥","七莘路","虹莘路","顾戴路","东兰路","虹梅路","虹漕路","桂林公园","国际客运中心","提篮桥","江浦公园","宁国路","隆昌路","爱国路","复兴岛","东陆路","杨高北路","金京路","申江路","金运路","金沙江西路","丰庄","祁连山南路","真北路","大渡河路","武宁路","江宁路","自然博物馆","淮海中路","世博会博物馆","世博大道","华夏中路","周浦东","鹤沙航城","航头东","新场","野生动物园","惠南","惠南东","书院","临港大道","滴水湖","诸光路","蟠龙路","徐盈路","徐泾北城","嘉松中路","赵巷","汇金路","青浦新城","漕盈路","淀山湖大道","朱家角","东方绿舟","三鲁公路","闵瑞路","浦航路","东城一路","汇臻路"]

  static LINE_COLORS = {
    1: '#EE1822',
    2: '#85C73F',
    3: '#FDD303',
    4: '#4E2C8D',
    5: '#8F57A2',
    6: '#D7156B',
    7: '#F26F1F',
    8: '#009DD7',
    9: '#67CCF6',
    10: '#B8A8CF',
    11: '#7C1F31',
    12: '#54ae11',
    13: '#E77DAD',
    16: '#78d6cd',
    17: '#B6766C',
    41: '#B5B6B6',
  }
}

